<?php

return [
    'index' => [
        'title' => 'الإعلانات'
    ],

    'create' => [
        'title'    => 'اضافة إعلان',
        'note'     => 'يجب ان يحتوي الإعلان على احد الحقول (الوصف، الصورة، الرابط الخارجي، يوتيوب فديو).',
        'btn-send' => 'ارسال'
    ],

    'store' => [
        'success' => 'تم انشاء الإعلان بنجاح.',
        'failed'  => 'لم يتم انشاء الإعلان، اعد المحاولة.'
    ],

    'show' => [],

    'edit' => [
        'header'         => 'تحرير الإعلان',
        'note'           => 'يجب ان يحتوي الإعلان على احد الحقول (الوصف، الصورة، الرابط الخارجي، يوتيوب فديو).',
        'change-content' => 'تغيير محتوى الإعلان',
        'change-image'   => 'تغيير صورة الإعلان',
    ],





    'components' => [
        'datatable' => [
            'title-'  => 'جميع الإعلانات',
            'title-1' => 'جميع الإعلانات المعلنه للطلاب',
            'title-2' => 'جميع الإعلانات المعلنه للمستمعين',
            'title-3' => 'جميع الإعلانات المعلنه للطلاب و للمستمعين',
            'btn-add' => 'اضافة إعلان',
            'column'  => [
                'sequence'   => 'ت',
                'title'      => 'العنوان',
                'type'       => 'النوع',
                'state'      => 'الحالة',
                'created_at' => 'تاريخ الانشاء',
            ]
        ]
    ],

    'label' => [
        'title'         => 'العنوان',
        'description'   => 'الوصف',
        'image'         => 'الصورة',
        'url'           => 'الرابط الخارجي',
        'youtube_video' => 'يوتيوب فديو',
        'type'          => 'النوع',
        'state'         => 'الحالة',
        'check-image'   => 'الإعلان يحتوي على صورة.'
    ],

    'placeholder' => [
        'title'         => 'عنوان الإعلان',
        'description'   => 'وصف عن الإعلان',
        'image'         => 'اختر صورة للإعلان',
        'url'           => 'URL',
        'youtube_video' => 'Video Id',
        'type'          => 'النوع',
        'state'         => 'الحالة',
        'check-image'   => 'اذا فعلت هذا الاختيار سوف يسمح بجعل محتوى الإعلان فارغ.'
    ],
];
