<?php

return [
    'index' => [
        'title' => 'الإعلانات'
    ],

    'create' => [
        'title'    => 'اضافة إعلان',
        'note'     => 'يجب ان يحتوي الإعلان على احد الحقول (الوصف، الصورة، يوتيوب فديو).',
        'btn-send' => 'ارسال'
    ],

    'store' => [
        'success' => 'تم انشاء الإعلان بنجاح.',
        'failed'  => 'لم يتم انشاء الإعلان، اعد المحاولة.'
    ],

    'edit' => [
        'note'         => 'يجب ان يحتوي الإعلان على احد الحقول (الوصف، الصورة، يوتيوب فديو).',
        'change-info'  => 'تغيير معلومات الإعلان',
        'change-image' => 'تغيير صورة الإعلان',
        'btn-save'     => 'حفظ'
    ],

    'update' => [
        'success' => 'تم تحديث الإعلان بنجاح.',
        'failed'  => 'لم يتم تحديث الإعلان، اعد المحاولة.'
    ],

    'destroy' => [
        'success' => 'تم حذف الإعلان بنجاح.',
        'failed'  => 'لم يتم حذف الإعلان، اعد المحاولة.'
    ],

    'change-state' => [
        'title-0'     => 'تم الغاء تفعيل الإعلان رقم (:number).',
        'title-1'     => 'تم تفعيل الإعلان رقم (:number).',
        'title-error' => 'الإعلان غير موجود.'
    ],

    'components' => [
        'datatable' => [
            'header-'  => 'جميع الإعلانات',
            'header-1' => 'الإعلانات للطلاب فقط',
            'header-2' => 'الإعلانات للمستمعين فقط',
            'header-3' => 'الإعلانات لكلاهما فقط',
            'btn-add'  => 'اضافة إعلان',
            'column'   => [
                'number'     => 'رقم',
                'title'      => 'العنوان',
                'type'       => 'النوع',
                'state'      => 'الحالة',
                'created-at' => 'تاريخ الإنشاء'
            ]
        ],

        'modal-show' => [
            'header'        => 'عرض الإعلان',
            'btn-edit'      => 'تحرير الإعلان',
            'btn-dismiss'   => 'لا شكرا',
            'error-message' => 'الإعلان غير موجود'
        ],

        'modal-delete' => [
            'header'        => 'حذف الإعلان',
            'message'       => 'هل تريد حذف الإعلان رقم (:number)؟',
            'btn-yes'       => 'نعم',
            'btn-no'        => 'لا',
            'error-message' => 'الإعلان غير موجود'
        ]
    ],

    'label' => [
        'title'         => 'العنوان',
        'description'   => 'الوصف',
        'image'         => 'الصورة',
        'youtube_video' => 'يوتيوب فديو',
        'type'          => 'النوع',
        'state'         => 'الحالة',
        'created_at'    => 'تاريخ الإنشاء',
        'check-image'   => 'الإعلان يحتوي على صورة.',
        'check-content' => 'الإعلان يحتوي على (الوصف، يوتيوب فديو).'
    ],

    'placeholder' => [
        'title'         => 'العنوان',
        'description'   => 'الوصف',
        'image'         => 'اختر الصورة',
        'youtube_video' => 'Video id',
        'type'          => 'اختر النوع',
        'state'         => 'اختر الحالة',
        'check-image'   => 'اذا فعلت هذا الاختيار سوف يسمح بجعل الإعلان لايحتوي على (وصف، يوتيوب فديو).',
        'check-content' => 'اذا فعلت هذا الاختيار سوف يسمح بجعل الاعلان لايحتوي على صورة.'
    ],
];
