<?php
return [
    'column' => [
        'id'             => 'رقم',
        'name'           => 'الاسم',
        'type'           => 'النوع',
        'lang'           => 'اللغة',
        'stage'          => 'المرحلة',
        'email'          => 'البريد',
        'phone'          => 'الهاتف',
        'password'       => 'كلمة المرور',
        'gender'         => 'الجنس',
        'country'        => 'البلد',
        'birth_date'     => 'تاريخ الميلاد',
        'address'        => 'العنوان',
        'certificate'    => 'الشهادة',
        'created_at'     => 'تاريخ انشاء الحساب',
        'last_login'     => 'أخر تسجيل دخول',
        'state'          => 'الحالة',
        'remember_token' => 'الرمز',

        'last_login_null' => 'لم يسجل',
        'null'            => 'لا توجد بيانات',
        're_password'     => 'اعد كلمة المرور'
    ],

    'placeholder' => [
        'name'        => 'الاسم الرباعي واللقب',
        'stage'       => 'اختر المرحلة',
        'email'       => 'البريد الإلكتروني',
        'phone'       => 'رقم الهاتف',
        'gender'      => 'اختر الجنس',
        'country'     => 'اختر البلد',
        'certificate' => 'اختر الشهادة'
    ],

    'index' => [
        'title-1'   => 'الطلاب',
        'title-2'   => 'المستمعين',

        'datatable' => [
            'title-1'      => 'الطلاب المسجلين في المعهد',
            'title-2'      => 'المستمعين المسجلين في المعهد',
            'btn-create-1' => 'اضافة طالب',
            'btn-create-2' => 'اضافة مستمع',
        ],

        'modal' => [
            'simple-show' => [
                'header'      => 'معلومات الحساب',
                'message'     => 'المستخدم غير موجود',
                'btn-show'    => 'عرض ملف المستخدم',
                'btn-dismiss' => "لا شكرا"
            ]
        ]
    ],

    'create' => [
        'title-1' => 'انشاء حساب طالب',
        'title-2' => 'انشاء حساب مستمع',
        'btn'     => 'انشاء حساب',
        'success' => 'تم انشاء الحساب بنجاح',
        'failed'  => 'لم يتم انشاء الحساب، اعد المحاولة',
    ],

    'edit' => [
        'title'           => 'حساب: ',
        'change-info'     => 'تغيير معلومات الحساب',
        'change-password' => 'تغيير كلمة المرور',
        'btn'             => 'ارسال'
    ],













    'filter' => [
        'type' => 'نوع المستخدم غير صحيح'
    ]

];
