<?php

return [
    "index" => [
        "title-1"   => "الطلاب",
        "title-2"   => "المستمعين",
        "filter-1"  => [
            "header" => "الطلاب",
            "untrusted" => "الطلاب غير الموثقة حساباتهم",
            "trusted"   => "الطلاب الموثقة حساباتهم",
            "disable"   => "الطلاب المعطلة حساباتهم"
        ],
        "filter-2"  => [
            "header" => "المستمعين",
            "untrusted" => "المستمعين غير الموثقة حساباتهم",
            "trusted"   => "المستمعين الموثقة حساباتهم",
            "disable"   => "المستمعين المعطلة حساباتهم"
        ],
        "datatable" => [
            "header-1" => "الطلاب المسجلين في المعهد",
            "header-2" => "المستمعين المسجلين في المعهد",
            "btn-add"  => "اضافة",
            "column"   => [
                "number"     => "رقم",
                "name"       => "الاسم",
                "email"      => "البريد الإلكتروني",
                "phone"      => "الهاتف",
                "last-login" => "آخر تسجيل دخول"
            ]
        ]
    ],

    "create" => [
        "title-1"  => "اضافة طالب",
        "title-2"  => "اضافة مستمع",
        "btn-send" => "ارسال"
    ],

    "store" => [
        "success" => "تم انشاء حساب المستخدم بنجاح.",
        "failed"  => "لم يتم انشاء حساب المستخدم، اعد المحاولة."
    ],

    "show" => [
        "tab" => [
            "profile"       => "الملف الشخصي",
            "documents"     => "المستمسكات"
        ],

        "profile-tab" => [
            "btn-edit" => "تحرير الحساب"
        ]
    ],

    "edit" => [
        "note"         => [
            "header"         => "بعض المعلومات حول تعديل الحساب",
            "content-line-1" => "يمكن تعديل جميع معلومات الطالب وهي الاسم والبريد الالكتروني ورقم الهاتف وكلمة المرور والجنس والبلد والمرحلة والشهادة وتاريخ الميلاد والعنوان.",
            "content-line-2" => "يمكن للطالب من خلال تطبيق الهاتف تعديل الاسم والبلد والشهادة وتاريخ الميلاد والعنوان.",
            "content-line-3" => "يمكن للمستمع من خلال تطبيق الهاتف تعديل الاسم والبلد.",
            "content-line-4" => "بعد تغيير رقم الهاتف او البريد الالكتروني او كلمة المرور سوف يتم تسجيل خروج تلقائي من جميع الاجهزة."
        ],
        "change-info"  => "تغيير المعلومات",
        "change-phone" => "تغيير رقم الهاتف",
        "change-email" => "تغيير البريد الالكتروني",
        "change-pass"  => "تغيير كلمة مرور",
        "btn-save"     => "حفظ"
    ],

    "update" => [
        "success" => "تم تحديث حساب المستخدم بنجاح.",
        "info"    => "ليس هنالك تغيير في الحساب."
    ],

    "change-state" => [
        "success-1" => "تم تفعيل حساب المستخدم بنجاح.",
        "failed-1"  => "لم يتم تفعيل حساب المستخدم، اعد المحاولة.",
        "success-3" => "تم تعطيل حساب المستخدم بنجاح.",
        "failed-3"  => "لم يتم تعطيل المستخدم الاستاذ، اعد المحاولة."
    ],

    "components" => [


        "modal-show" => [
            "header"        => "معلومات الحساب",
            "btn-info"      => "عرض",
            "btn-dismiss"   => "لا شكرا",
            "error-message" => "المستخدم غير موجود"
        ],

        "modal-change-state" => [
            "header"          => "حالة الحساب",
            "active-message"  => "هل تريد تفعيل حساب المستخدم رقم (:number)؟",
            "disable-message" => "هل تريد تعطيل حساب المستخدم رقم (:number)؟",
            "error-message"   => "المستخدم غير موجود",
            "btn-yes"         => "نعم",
            "btn-no"          => "لا"
        ]
    ],

    "label" => [
        "name"        => "الاسم",
        "type"        => "نوع الحساب",
        "lang"        => "اللغة",
        "stage"       => "المرحلة",
        "email"       => "البريد الالكتروني",
        "re-email"    => "اعد البريد الالكتروني",
        "phone"       => "رقم الهاتف",
        "re-phone"    => "اعد رقم الهاتف",
        "password"    => "كلمة المرور",
        "re-password" => "اعد كلمة المرور",
        "gender"      => "الجنس",
        "country"     => "البلد",
        "birth-date"  => "تاريخ الميلاد",
        "address"     => "العنوان",
        "certificate" => "الشهادة",
        "state"       => "حالة الحساب",
        "last-login"  => "أخر تسجيل دخول",
        "created-at"  => "تاريخ انشاء الحساب",
        "updated-at"  => "تاريخ تعديل الحساب",
    ],

    "placeholder" => [
        "name"        => "الاسم الرباعي واللقب",
        "lang"        => "اختر اللغة",
        "stage"       => "اختر المرحلة",
        "email"       => "البريد الالكتروني",
        "phone"       => "رقم الهاتف",
        "gender"      => "اختر الجنس",
        "country"     => "اختر البلد",
        "birth-date"  => "تاريخ الميلاد",
        "address"     => "العنوان الكامل",
        "certificate" => "اختر الشهادة"
    ]
];
